---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetClosedShell
source: html/58410893-1269-98e3-7a07-e5dacafbc9fe.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetClosedShell Method

Gets the collection of polygons that form a closed shell.
 This method returns a collection of polyloops (planar
 polygons) that defines an enclosed volume measured by
 interior bounding surfaces.

## Syntax (C#)
```csharp
public IList<Polyloop> GetClosedShell()
```

## Returns
the collection of polygons that form a closed shell.